Correlation/CorrelationSampleComApp/test/TestCorrelation/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cor="http://xml.netbeans.org/schema/correlationSampleSchema">
  <soapenv:Body>
    <cor:initialisationRequest>
      <cor:name>Ileana</cor:name>
    </cor:initialisationRequest>
  </soapenv:Body>
</soapenv:Envelope>